In [1]:
import numpy as np
import pandas as pd

In [2]:
# df.loc[행 인덱싱값]
# df.loc[행 인덱싱값, 열 인덱싱값]

In [3]:
df = pd.DataFrame(np.arange(10, 22).reshape(3, 4),
                  index=["a", "b", "c"],
                  columns=["A", "B", "C", "D"])
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [4]:
df.loc["a"]

A    10
B    11
C    12
D    13
Name: a, dtype: int32

In [8]:
df[:1]

    A   B   C   D
a  10  11  12  13

In [9]:
df.loc["b":"c"]

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [10]:
df["b":"c"]

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [11]:
df.loc[["b", "c"]]

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [12]:
# df[["b", "c"]]    # KeyError

In [13]:
df.A > 15

a    False
b    False
c     True
Name: A, dtype: bool

In [18]:
df.B >= 15

a    False
b     True
c     True
Name: B, dtype: bool

In [14]:
df.loc[df.A > 15]

    A   B   C   D
c  18  19  20  21

In [33]:
df.loc[df.B >= 15]

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

In [19]:
def select_rows(df):
    return df.A > 15

In [20]:
select_rows(df)

a    False
b    False
c     True
Name: A, dtype: bool

In [21]:
df.loc[select_rows(df)]

    A   B   C   D
c  18  19  20  21

In [22]:
# df.loc["A"]  # KeyError

In [23]:
# df.loc[["A", "B"]]  # KeyError

In [24]:
df2 = pd.DataFrame(np.arange(10, 26).reshape(4, 4), columns=["A", "B", "C", "D"])
df2

    A   B   C   D
0  10  11  12  13
1  14  15  16  17
2  18  19  20  21
3  22  23  24  25

In [25]:
df2.loc[1:2]

    A   B   C   D
1  14  15  16  17
2  18  19  20  21

In [29]:
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [27]:
df.loc["a", "A"]
# loc를 쓰면 행->열 순서로 씀, df 그 자체에서 쓰고 싶으면 열 -> 행 04.01 참고

10

In [28]:
df.loc["b":, "A"]

b    14
c    18
Name: A, dtype: int32

In [30]:
df.loc["a", :] # 시리즈 형태로 표시됨

A    10
B    11
C    12
D    13
Name: a, dtype: int32

In [31]:
df.loc[["a", "b"], ["B", "D"]]

    B   D
a  11  13
b  15  17

In [32]:
df.loc[df.A > 10, ["C", "D"]]

    C   D
b  16  17
c  20  21

In [35]:
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [34]:
df.iloc[0,1]

11

In [36]:
df.iloc[:2, 2]

a    12
b    16
Name: C, dtype: int32

In [37]:
df.iloc[0, -2:]

C    12
D    13
Name: a, dtype: int32

In [39]:
df.iloc[2:3, 1:3]

    B   C
c  19  20

In [40]:
df.iloc[-1]

A    18
B    19
C    20
D    21
Name: c, dtype: int32

In [41]:
df.iloc[-1] = df.iloc[-1] * 2
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  36  38  40  42

In [42]:
%timeit df.loc["a", "A"]

8.45 µs ± 77.1 ns per loop (mean ± std. dev. of 7 runs, 100000 loops each)

In [43]:
%timeit df.at["a", "A"]

5.5 µs ± 58.4 ns per loop (mean ± std. dev. of 7 runs, 100000 loops each)

In [44]:
%timeit df.iloc[0, 0]

9.52 µs ± 46.7 ns per loop (mean ± std. dev. of 7 runs, 100000 loops each)

In [45]:
%timeit df.iat[0, 0]

5.87 µs ± 88.1 ns per loop (mean ± std. dev. of 7 runs, 100000 loops each)